<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ДЗ №6</title>
    <style>
        ol, a {
            font-size: 1.5rem;
        }
    </style>
</head>
<body>
    <h1>Урок 6. Интерактивность: Методы передачи данных GET и POST, работа с формами и пользовательскими данными   </h1>
<ol>
    <li>
        <a href="less6.1.php">
        Создать форму-калькулятор операциями: сложение, вычитание, умножение, деление. Не забыть обработать деление на ноль! Выбор операции можно осуществлять с помощью тега select.
        </a>
    </li>
    <li>
        <a href="less6.2.php">
        Создать калькулятор, который будет определять тип выбранной пользователем операции, ориентируясь на нажатую кнопку.
        </a>
    </li>
    <li>
        <a href="less6.3.php">
        Добавить функционал отзывов в имеющийся у вас проект
        </a>
    </li>
    <li>
        <a href="less6.4.php">
        Создать страницу каталога товаров: товары хранятся в БД (структура прилагается);
        страница формируется автоматически; по клику на товар открывается карточка товара с подробным описанием.    подумать, как лучше всего хранить изображения товаров.
        </a>
    </li>
    <li>
        <a href="less6.5.php">
        *Написать CRUD-блок для управления выбранным модулем через единую функцию (doFeedbackAction())
        </a>
    </li>
</ol>
</body>
</html>